SC-RU/mpu6050-attitude-estimator/STM32_Nucleo_F446RE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           main.h
  * @brief          Header for main.c file.
  *                 This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/

/* USER CODE BEGIN Includes */

#include "FreeRTOS.h"
#include "task.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/

/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/

/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/

/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/

void Error_Handler(void);

/* USER CODE BEGIN EFP */

/**
 * @brief       Transmits a null-terminated status or debug string over USART2.
 *
 * @details     This helper provides a simple project-wide UART print interface for
 *              startup messages, fault reporting, and lightweight diagnostics.
 *              The function validates the input pointer before calling the HAL UART
 *              transmit routine.
 *
 * @param msg:  Pointer to a null-terminated character string to transmit.
 */
void uart_print(const char *msg);

/**
 * @brief   Reports minimum recorded stack headroom for each application task.
 *
 * @details Queries FreeRTOS for the stack high-water mark of SensorTask,
 *          AttitudeTask, and TelemetryTask using their stored task handles.
 *          The reported values are expressed in stack words, not bytes, and
 *          represent the smallest amount of free stack each task has had since
 *          startup. This function is intended for hardware validation and stack
 *          sizing verification.
 */
#define CHECK_STACK_OVERFLOW_DEBUG 0
#if CHECK_STACK_OVERFLOW_DEBUG

void reportStackHighWaterMarks(void);

#endif

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/

#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */


#define UART_TRANSMIT_TIMEOUT_MS  10U       ///< ~1.5x worst-case CSV line transmit time at 115200 baud

extern volatile uint32_t uartFailureCount;  ///< UART transmit timeout count
extern volatile uint32_t missedSampleCount; ///< SensorTask cycles with no valid sample

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
